Catalogs/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СерииНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/САВ_ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>САВ_ХарактеристикиНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьДляСерий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВладелецПараметра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвойствоПараметра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.САВ_ВидыСвойствНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/САВ_ВидыСвойствНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>САВ_ВидыСвойствНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерПараметра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СерииНоменклатуры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура САВ_ПриОткрытииПосле(Отказ)
	//Вставить содержимое обработчика 
	РезультатЗапроса(); 
	//РезультатЗапросаОтличие();
	//Закладка = ЭтаФорма.ХарактеристикиИзделия.ПолучитьЭлементы();
	//Если Закладка.Количество()>0 Тогда
	//	ЭтаФорма.Элементы.СтраницаХарактеристики.Видимость=Истина;
	//Иначе                                                                
	//	ЭтаФорма.Элементы.СтраницаХарактеристики.Видимость=Ложь;
	//КонецЕсли;


КонецПроцедуры

&НаСервере
Процедура РезультатЗапроса() 
	Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
			|				Хар.НомерПараметра,
			|				Хар.Родитель,
			|				Хар.Ссылка, 
			|				РегХар.ВладелецПараметра,
			|				Хар.Ссылка КАК Наименование,
			|				Хар.Характеристика,
			|				РегХар.ЗначениеПоУмолчанию
			|			ИЗ
			|				Справочник.САВ_ВидыСвойствНоменклатуры   КАК Хар    
			|			Левое Соединение  РегистрСведений.САВ_ХарактеристикиНоменклатуры КАК РегХар
			|			ПО
			|			Хар.Ссылка=РегХар.СвойствоПараметра.Ссылка
			|			ГДЕ
			|				   РегХар.ВладелецПараметра=&Номенклатура
			|				УПОРЯДОЧИТЬ ПО
			|					Хар.Родитель.Код,
			|				    Хар.Ссылка.Код
			|ИТОГИ ПО
			|    Хар.Родитель ИЕРАРХИЯ
			|АВТОУПОРЯДОЧИВАНИЕ"; 


			Запрос.УстановитьПараметр("Номенклатура",Объект.Ссылка);
Результат = Запрос.Выполнить(); 
Дерево_ = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);       
ЗначениеВРеквизитФормы(Дерево_, "ХарактеристикиИзделия");

	
КонецПроцедуры

&НаСервере
Процедура РезультатЗапросаОтличие() 
	Запрос=Новый Запрос;
		Запрос.Текст="Выбрать  
			|	ВСН.Родитель,          
			|	ВСН.НомерПараметра,   
			|	РН.СвойствоПараметра КАК Наименование,  
			|	РН.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию
			|	ИЗ
			|	РегистрСведений.САВ_ХарактеристикиНоменклатуры КАК РН
			|   
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	(Выбрать
			|	РБ.СвойствоПараметра,
			|	РБ.ЗначениеПоУмолчанию
			|ИЗ
			|	РегистрСведений.САВ_ХарактеристикиНоменклатуры КАК РБ
			|ГДЕ
			|	РБ.ВладелецПараметра=&База) КАК РБазы 
			|	ПО РН.СвойствоПараметра=РБазы.СвойствоПараметра   
			|
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	Справочник.САВ_ВидыСвойствНоменклатуры КАК ВСН
			|ПО
			|	ВСН.Ссылка=РН.СвойствоПараметра	
			|	ГДЕ
			|	РН.ВладелецПараметра=&Серия 
			|	И НЕ
			|	РН.ЗначениеПоУмолчанию=РБазы.ЗначениеПоУмолчанию
			|				УПОРЯДОЧИТЬ ПО
			|					ВСН.Родитель.Код,
			|				    ВСН.Ссылка.Код
			|ИТОГИ ПО
			|    ВСН.Родитель ИЕРАРХИЯ
			|АВТОУПОРЯДОЧИВАНИЕ"; 
		
		
//Определение базы
Запрос1=Новый запрос;
Запрос1.Текст="ВЫБРАТЬ
	|	*	
	|ИЗ
	|  	РегистрСведений.САВ_ХарактеристикиНоменклатуры КАК РС
	|ГДЕ
	|  	РС.ВладелецПараметра=&ВП";
Запрос1.УстановитьПараметр("ВП",Объект.Ссылка.ДСТ_Номенклатура);
Рез=Запрос1.Выполнить().Выбрать();
БазовыйОбъект=Неопределено;
Если Рез.Количество()>0 Тогда
	БазовыйОбъект=Объект.Ссылка.ДСТ_Номенклатура;
КонецЕсли;
Запрос1=Новый запрос;
Запрос1.Текст="ВЫБРАТЬ
	|	*	
	|ИЗ
	|  	РегистрСведений.САВ_ХарактеристикиНоменклатуры КАК РС
	|ГДЕ
	|  	РС.ВладелецПараметра=&ВП";
Запрос1.УстановитьПараметр("ВП",Объект.Ссылка.ДСТ_Характеристика);
Рез=Запрос1.Выполнить().Выбрать();

Если Рез.Количество()>0 Тогда
	БазовыйОбъект=Объект.Ссылка.ДСТ_Характеристика;
КонецЕсли;
Если БазовыйОбъект=Неопределено Тогда
	Сообщить("Не найдены базовые параметры для данной характеристики. Обратитесь к Администратору 1С!"); 
	Возврат;
Иначе
	


//****************
		
            Запрос.УстановитьПараметр("База",БазовыйОбъект); 
			Запрос.УстановитьПараметр("Серия",Объект.Ссылка);
Результат = Запрос.Выполнить(); 
Дерево_ = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);       
ЗначениеВРеквизитФормы(Дерево_, "ХарактеристикиИзделия");
КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура САВ_ЗагрузитьДругиеПараметрыПосле(Команда) 
 СтандартнаяОбработка=ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = ""; 
	Фильтр = "Excel (*.xlsx)|*.xlsx"; 
	Диалог.Фильтр = Фильтр; 
    Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог = "D:\";
	Если Диалог.Выбрать() Тогда
		ИмяФайла = Диалог.ПолноеИмяФайла;
	КонецЕсли;

	




	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
		Эксель.DisplayAlerts = 0;
		Эксель.Visible = 0;
	Исключение
   		Сообщить(ОписаниеОшибки()); 
   		Возврат;
	КонецПопытки;
				
	ЭксельКнига = Эксель.Workbooks.Open(ИмяФайла);	
	
	// Перебираем все листы
	    ТекГр="";
		ТекГрНаим=""; 
		Груп="";
		Лист = ЭксельКнига.Sheets(1);
		КоличествоСтрок = 350;//Лист.Cells(1, 1).SpecialCells(11).Row;
		КоличествоКолонок = 3;//Лист.Cells(1, 1).SpecialCells(11).Column;
 
 
 Номенкл=ТекущийОбъект();
 
	ОчиститьРегистр(Номенкл); 		
		// Перебираем строки
		Для НомерСтроки = 16 По КоличествоСтрок Цикл  
			Попытка
				Груп=Лист.Cells(НомерСтроки, 1).Value;
			Исключение
				Груп="";
			КонецПопытки;
			
			Если Груп=Неопределено Тогда
				ТекГрНаим=СокрЛП(Строка(Лист.Cells(НомерСтроки, 2).Value)); 
				СоздатьГруппу(ТекГрНаим);
				
			Иначе
					ТекНом=Лист.Cells(НомерСтроки, 1).Value;
				Попытка
					ТекПар=Лист.Cells(НомерСтроки, 2).Value;
				Исключение
					ТекПар="";
				КонецПопытки;
			    Попытка
					ТекЗнач=Лист.Cells(НомерСтроки, 3).Value;
				Исключение
					ТекЗнач="";
				КонецПопытки;   
				////Если НЕ ЭтотОбъект.Номенклатура.Пустая() Тогда
				////	Номенкл=ЭтотОбъект.Номенклатура;
				////КонецЕсли;

				////Если НЕ ЭтотОбъект.Характеристика.Пустая() Тогда
				////	Номенкл=ЭтотОбъект.Характеристика;
				////КонецЕсли;

				////Если НЕ ЭтотОбъект.Серия.Пустая() Тогда
				////	Номенкл=ЭтотОбъект.Серия;
				////КонецЕсли;

				
				СоздатьЭлемент(ТекГрНаим,ТекПар,ТекЗнач,Номенкл,ТекНом);
				
				
			КонецЕсли;
			
			КонецЦикла;
			

		
	Эксель.Workbooks.Close();
	Эксель.Application.Quit();
    РезультатЗапроса();
КонецПроцедуры

&НаСервере
Функция ТекущийОбъект()
	Возврат Объект.Ссылка;
КонецФункции

Функция СоздатьГруппу(НаимГр) 
	ТекГр=""; 
	Запрос=Новый Запрос;
	Запрос.Текст="Выбрать
		| Ссылка
		|ИЗ
		|	Справочник.САВ_ВидыСвойствНоменклатуры КАК ВС
		|ГДЕ
		|	ВС.Наименование=&Наименование
		|И
		| 	ВС.ЭтоГруппа=Истина";
	Запрос.УстановитьПараметр("Наименование",НаимГр);
	Результат=Запрос.Выполнить().Выбрать();
	Если Результат.Количество()=0 Тогда
		ТекГр=Справочники.САВ_ВидыСвойствНоменклатуры.СоздатьГруппу();
		ТекГр.Наименование=НаимГр;
		ТекГр.Записать(); 
	КонецЕсли;
	
	Возврат НаимГр;
КонецФункции   

Процедура ОчиститьРегистр(номен)
		НаборЗаписей = РегистрыСведений.САВ_ХарактеристикиНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВладелецПараметра.Установить(Номен);
	НаборЗаписей.Записать(); 
КонецПроцедуры

Процедура СоздатьЭлемент(ТекГрНаим,ТекПар,ТекЗнач, Номен, ТекНом) 
	ПВХ="";
	Запрос=Новый Запрос;
	Запрос.Текст="Выбрать
		| Ссылка
		|ИЗ
		|	Справочник.САВ_ВидыСвойствНоменклатуры КАК ВС
		|ГДЕ
		|	ВС.Наименование=&Наименование
		|И
		| 	ВС.ЭтоГруппа=Ложь";
	Запрос.УстановитьПараметр("Наименование",ТекПар);
	Результат=Запрос.Выполнить().Выбрать();
	Если Результат.Количество()=0 Тогда  
		Сообщить(ТекПар);
		ТекЭл=Справочники.САВ_ВидыСвойствНоменклатуры.СоздатьЭлемент();
		ТекЭл.Наименование=ТекПар;  
		ТекЭл.НомерПараметра=ТекНом;
		ТекЭл.Родитель=Справочники.САВ_ВидыСвойствНоменклатуры.НайтиПоНаименованию(ТекГрНаим).Ссылка;
		Если ПВХ=ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(ТекПар) Тогда
			ТекЭл.Характеристика=ПВХ; 
		Иначе 
 КЧ = Новый КвалификаторыСтроки(100);
 Массив = Новый Массив;
 Массив.Очистить();
 Массив.Добавить(Тип("СправочникСсылка.ЗначенияСвойствОбъектов"));
 ТЧ=Новый ОписаниеТипов(Массив,КЧ);
 НовЭл=ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
 НовЭл.Наименование=ТекПар;
 //НовЭл.НазначениеСвойства = Справочники.Номенклатура;
 НовЭл.ТипЗначения = ТЧ; 
 НовЭл.Заголовок=ТекПар;
 НовЭл.Записать();

 ТекЭл.Характеристика=ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(ТекПар);
			
			
			
		КонецЕсли;
 ТекЭл.Записать();
Иначе
 	Если Результат.Следующий() Тогда
 		ТекЭл=Результат.Ссылка; 
	Иначе
		Сообщить("Системная ошибка загрузки. Обратитесь к администратору 1С!"); 
		Возврат;
	КонецЕсли;
	
КонецЕсли;	

//Создание записи регистра
 
	
 	НаборЗаписей = РегистрыСведений.САВ_ХарактеристикиНоменклатуры.СоздатьМенеджерЗаписи(); 
 	НаборЗаписей.ВладелецПараметра=Номен;
	НаборЗаписей.СвойствоПараметра=Справочники.САВ_ВидыСвойствНоменклатуры.НайтиПоНаименованию(ТекПар); 
	
	ЗСО=Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(ТекЗнач,Ложь,,ТекЭл.Характеристика);  
	Запрос1 =Новый Запрос;
	Запрос1.Текст="ВЫБРАТЬ
		|	Ссылка
		|ИЗ
		|  	Справочник.ЗначенияСвойствОбъектов КАК ЗСО
		|ГДЕ
		|	ЗСО.Владелец=&ТекЭл
		|И
		|	ЗСО.Наименование ПОДОБНО &ТекЗнач";
	Запрос1.УстановитьПараметр("текЭл",ТекЭл.Характеристика);
	Запрос1.УстановитьПараметр("ТекЗнач","%"+ТекЗнач+"%");
	Рез=Запрос1.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		ЗСО=Рез.Ссылка;
	Иначе
		
	
	Запрос2=Новый Запрос; 
	Запрос2.Текст="ВЫБРАТЬ
		|	*
		|ИЗ
		|  	Справочник.ЗначенияСвойствОбъектов КАК ЗСО
		|ГДЕ
		|	ЗСО.Владелец=&ТекЭл";
	Запрос2.УстановитьПараметр("ТекЭл",ТекЭл.Характеристика);
	Результат=Запрос2.Выполнить().Выбрать();
	НомерЗн=Результат.Количество();
		ЗСО=Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
		ЗСО.Наименование= Строка(НомерЗн+1)+". "+ТекЗнач;
		ЗСО.Владелец=ТекЭл.Характеристика;  
		ЗСО.Записать();
	КонецЕсли;
	
	
	НаборЗаписей.ЗначениеПоУмолчанию=ЗСО;
	НаборЗаписей.Записать();



//************************
	
	
		

	КонецПроцедуры
	
&НаСервере
Процедура САВ_ВыводитьРазличныеПриИзмененииПослеНаСервере()  
	Если ВыводитьРазличные=Истина Тогда
		РезультатЗапросаОтличие();
	Иначе
		РезультатЗапроса();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура САВ_ВыводитьРазличныеПриИзмененииПосле(Элемент) 
	САВ_ВыводитьРазличныеПриИзмененииПослеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура САВ_ХарактеристикиИзделияЗначениеПоУмолчаниюНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		СтандартнаяОбработка = Ложь;	
	
	ЗначениеОтбора = Новый Структура("Владелец",ТекСпр(Элементы.ХарактеристикиИзделия.ТекущиеДанные.Наименование));
	ПараметрыВыбора1 = Новый Структура("Отбор", ЗначениеОтбора, Истина);
	ПараметрыВыбора1.Вставить("РежимВыбора",Истина);
	
	ОткрытьФорму("Справочник.ЗначенияСвойствОбъектов.Форма.ФормаСписка",ПараметрыВыбора1,Элемент);

КонецПроцедуры

&НаСервере
Функция ТекСпр(НаименованиеОбъекта)
	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(НаименованиеОбъекта.Наименование);
КонецФункции

&НаКлиенте
Процедура САВ_ХарактеристикиИзделияЗначениеПоУмолчаниюПриИзмененииПосле(Элемент)
	ПереписатьПараметр(ЭтотОбъект.Элементы.ХарактеристикиИзделия.ТекущиеДанные.Наименование,ЭтотОбъект.Элементы.ХарактеристикиИзделия.ТекущиеДанные.НомерПараметра,Элемент.ТекстРедактирования);
КонецПроцедуры  

&НаСервере
Процедура ПереписатьПараметр(Параметр,НомерПараметра,НовоеЗначениеПараметра) 
	 Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ХН.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию
    |ИЗ
    |    РегистрСведений.САВ_ХарактеристикиНоменклатуры КАК ХН
    |ГДЕ
    |    ХН.ВладелецПараметра = &ВладелецПараметра И
    |    ХН.СвойствоПараметра = &СвойствоПараметра";
    
    Запрос.УстановитьПараметр("ВладелецПараметра", Объект.Ссылка);
    Запрос.УстановитьПараметр("СвойствоПараметра", Параметр);

    Выборка = Запрос.Выполнить().Выбрать();
    Если НЕ Выборка.Следующий() Тогда
        ТекЗапись = РегистрыСведений.САВ_ХарактеристикиНоменклатуры.СоздатьМенеджерЗаписи();
        ТекЗапись.ВладелецПараметра = Объект.Ссылка;
        ТекЗапись.СвойствоПараметра = Параметр;  
		ТекЗапись.ЗначениеПоУмолчанию=Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(НовоеЗначениеПараметра,Истина,,ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(Параметр));
        Попытка        
            ТекЗапись.Записать();
        Исключение
        КонецПопытки;
    Иначе
        ТекЗапись = РегистрыСведений.САВ_ХарактеристикиНоменклатуры.СоздатьМенеджерЗаписи();
        ТекЗапись.ВладелецПараметра = Объект.Ссылка;
        ТекЗапись.СвойствоПараметра = Параметр;
		
		ТекЗапись.Прочитать();
        
        ТекЗапись.ЗначениеПоУмолчанию  = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(НовоеЗначениеПараметра,Истина,,ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(Параметр));
        //Попытка
            ТекЗапись.Записать();
        //Исключение
        //КонецПопытки;

    КонецЕсли;   
	
КонецПроцедуры

&НаСервере
Процедура САВ_СформироватьСериюПослеНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура САВ_СформироватьСериюПосле(Команда) 
	
	
	САВ_СформироватьСериюПослеНаСервере();
КонецПроцедуры

&НаСервере
Процедура САВ_ИмяСерииПослеНаСервере() 
	
	Запрос=Новый Запрос;
		Запрос.Текст="Выбрать  
			|	ВСН.Родитель,          
			|	ВСН.НомерПараметра,   
			|	РН.СвойствоПараметра КАК Наименование,  
			|	РН.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию
			|	ИЗ
			|	РегистрСведений.САВ_ХарактеристикиНоменклатуры КАК РН
			|   
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	(Выбрать
			|	РБ.СвойствоПараметра,
			|	РБ.ЗначениеПоУмолчанию
			|ИЗ
			|	РегистрСведений.САВ_ХарактеристикиНоменклатуры КАК РБ
			|ГДЕ
			|	РБ.ВладелецПараметра=&База) КАК РБазы 
			|	ПО РН.СвойствоПараметра=РБазы.СвойствоПараметра   
			|
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	Справочник.САВ_ВидыСвойствНоменклатуры КАК ВСН
			|ПО
			|	ВСН.Ссылка=РН.СвойствоПараметра	
			|	ГДЕ
			|	РН.ВладелецПараметра=&Серия 
			|	И НЕ
			|	РН.ЗначениеПоУмолчанию=РБазы.ЗначениеПоУмолчанию
			|				УПОРЯДОЧИТЬ ПО
			|					ВСН.Родитель.Код,
			|				    ВСН.Ссылка.Код"; 
		
		
//Определение базы
Запрос1=Новый запрос;
Запрос1.Текст="ВЫБРАТЬ
	|	*	
	|ИЗ
	|  	РегистрСведений.САВ_ХарактеристикиНоменклатуры КАК РС
	|ГДЕ
	|  	РС.ВладелецПараметра=&ВП";
Запрос1.УстановитьПараметр("ВП",Объект.Ссылка.ДСТ_Номенклатура);
Рез=Запрос1.Выполнить().Выбрать();
БазовыйОбъект=Неопределено;
Если Рез.Количество()>0 Тогда
	БазовыйОбъект=Объект.Ссылка.ДСТ_Номенклатура;
КонецЕсли;
Запрос1=Новый запрос;
Запрос1.Текст="ВЫБРАТЬ
	|	*	
	|ИЗ
	|  	РегистрСведений.САВ_ХарактеристикиНоменклатуры КАК РС
	|ГДЕ
	|  	РС.ВладелецПараметра=&ВП";
Запрос1.УстановитьПараметр("ВП",Объект.Ссылка.ДСТ_Характеристика);
Рез=Запрос1.Выполнить().Выбрать();

Если Рез.Количество()>0 Тогда
	БазовыйОбъект=Объект.Ссылка.ДСТ_Характеристика;
КонецЕсли;
Если БазовыйОбъект=Неопределено Тогда
	Сообщить("Не найдены базовые параметры для данной характеристики. Обратитесь к Администратору 1С!"); 
	Возврат;
Иначе
	


//****************
		
            Запрос.УстановитьПараметр("База",БазовыйОбъект); 
			Запрос.УстановитьПараметр("Серия",Объект.Ссылка);
Результат = Запрос.Выполнить().Выбрать(); 
ИмяСерии="0";
Если Результат.Количество()=0 Тогда
	ИмяСерии="0";
Иначе 
	ИмяСерии="";
	Пока Результат.Следующий() Цикл           
		НомерЗначения="";
		Значен=Результат.ЗначениеПоУмолчанию;
		Если СтрДлина(Значен)>=4 Тогда 
			ДлинСтр=4;
		Иначе
			ДлинСтр=СтрДлина(Значен);
		КонецЕсли;
		Для инд=1 по ДлинСтр Цикл 
			Если Сред(Значен, инд, 1)="." Тогда
				НомерЗначения=Лев(Значен,Инд-1);
				Прервать;
			КонецЕсли;
			
			
			
		//	инд=инд+1;
		КонецЦикла;
		
		ИмяСерии=ИмяСерии+Строка(Результат.НомерПараметра)+"-"+Строка(НомерЗначения)+".";
	КонецЦикла;
	
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
		| 	Ссылка
		|ИЗ
		|  	Справочник.СерииНоменклатуры КАК СН
		|ГДЕ
		|   СН.Номер=&ИмяСерии
		|И
		|	НЕ СН.Ссылка=&Ссылка";
	Запрос.УстановитьПараметр("ИмяСерии",ИмяСерии);
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	Результат=Запрос.Выполнить().Выбрать();
	Если Результат.Количество()=0 Тогда
		Объект.Номер=ИмяСерии;
	Иначе
		Сообщить("Серия с номером "+ИмяСерии+" уже существует. Используйте имеющиеся серии номенклатуры");
	КонецЕсли;
	


КонецЕсли;

КонецЕсли;

	

	
	
	
	
	
	
	
	
	
	
	
	
	
//Сообщить(ИмяСерии);	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура САВ_ИмяСерииПосле(Команда)
	САВ_ИмяСерииПослеНаСервере();
КонецПроцедуры


&НаСервере
Процедура РСК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++Конарев Артикулы серий 
	НовыйЭлемент = Элементы.Добавить("Артикул", Тип("ПолеФормы"), Элементы.ГруппаШапка);	
	НовыйЭлемент.Заголовок = "Артикул";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Артикул"; 
	
КонецПроцедуры
